{"modelTopology":{"class_name":"Sequential","config":{"name":"sequential","layers":[{"class_name":"InputLayer","config":{"batch_input_shape":[null,26],"dtype":"float32","sparse":false,"name":"dense_input"}},{"class_name":"Dense","config":{"units":512,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense","trainable":true,"batch_input_shape":[null,26],"dtype":"float32"}},{"class_name":"Dense","config":{"units":165,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_1","trainable":true}}]},"keras_version":"tfjs-layers 4.22.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.22.0","convertedBy":null,"weightsManifest":[{"paths":["./model1.weights.bin"],"weights":[{"name":"dense/kernel","shape":[26,512],"dtype":"float32"},{"name":"dense/bias","shape":[512],"dtype":"float32"},{"name":"dense_1/kernel","shape":[512,165],"dtype":"float32"},{"name":"dense_1/bias","shape":[165],"dtype":"float32"}]}]}